## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.wordpress_new will be created
  + resource "aws_acm_certificate" "wordpress_new" {
      + arn                       = (known after apply)
      + domain_name               = "articles.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.articles.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                  = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.wordpress_new_cloudfront will be created
  + resource "aws_acm_certificate" "wordpress_new_cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "articles.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.articles.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                  = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>